package com.rahuljoshi.uttarakhandswabhimanmorcha.model.data

object DistrictAndTehsil {

    fun getDistricts(): List<String> {
        return listOf(
            "District",
            "Dehradun",
            "Haridwar",
            "Uttarkashi",
            "Tehri Garhwal",
            "Rudraprayag",
            "Chamoli",
            "Pauri Garhwal",
            "Almora",
            "Bageshwar",
            "Champawat",
            "Nainital",
            "Pithoragarh",
            "Udham Singh Nagar"
        )
    }

    fun getTehsils(district: String): List<String> {
        return when (district) {
            "District" -> listOf(
                "Tehsil"
            )
            "Dehradun" -> listOf(
                "चकराता",
                "देहरादून",
                "डोईवाला",
                "कालसी",
                "ऋषिकेश",
                "ट्यूनि",
                "विकासनगर"
            )

            "Haridwar" -> listOf(
                "भगवानपुर",
                "हरिद्वार",
                "लक्सर",
                "रुड़की"
            )

            "Uttarkashi" -> listOf(
                "बड़कोट",
                "भटवाड़ी",
                "चिन्यालीसौड़",
                "धौंतरी",
                "डुंडा",
                "जोशियाड़ा",
                "मोरी",
                "पुरोला"
            )

            "Tehri Garhwal" -> listOf(
                "बलगंगा",
                "देवप्रयाग",
                "धनोल्टी",
                "गजा",
                "घनसाली",
                "जखनिधार",
                "कंडीसौर",
                "कीर्तिनगर",
                "मदननेगी",
                "नैनबाग",
                "नरेंद्रनगर",
                "पौकी देवी",
                "प्रतापनगर",
                "टिहरी"
            )

            "Rudraprayag" -> listOf(
                "बसुकेदार",
                "जखोली",
                "रुद्रप्रयाग",
                "उखीमठ"
            )

            "Chamoli" -> listOf(
                "चमोली",
                "आदि बद्री",
                "गैरसैंण",
                "घाट",
                "जिलासू",
                "जोशीमठ",
                "कर्णप्रयाग",
                "नंदप्रयाग",
                "नारायणबगड़",
                "पोखरी",
                "थराली"
            )

            "Pauri Garhwal" -> listOf(
                "बिरोंखाल",
                "चाकीसैंण",
                "चौबट्टाखाल",
                "धूमाकोट",
                "जखनिखाल",
                "कोटद्वार",
                "लैंसडाउन",
                "पौड़ी",
                "रिक्खनिखाल",
                "सतपुली",
                "श्रीनगर",
                "थलीसैंण",
                "यमकेश्वर"
            )

            "Almora" -> listOf(
                "अल्मोड़ा",
                "भिकियासैंण",
                "भनौली",
                "चौखुटिया",
                "द्वाराहाट",
                "जैंती",
                "रानीखेत",
                "साल्ट",
                "सोमेश्वर",
                "स्याल्दे",
                "सुल्त"
            )

            "Bageshwar" -> listOf(
                "बागेश्वर",
                "दुग नाकुरी",
                "गरुड़",
                "कांडा",
                "कपकोट",
                "कफलिगैर"
            )

            "Champawat" -> listOf(
                "बराकोट",
                "चंपावत",
                "लोहाघाट",
                "पाटी",
                "पूर्णागिरी"
            )

            "Nainital" -> listOf(
                "बेतालघाट",
                "धारी",
                "हल्द्वानी",
                "कालाढूंगी",
                "खानस्यूं",
                "कोश्यांकुटोली",
                "लालकुआं",
                "नैनीताल",
                "रामनगर"
            )

            "Pithoragarh" -> listOf(
                "बंगापानी",
                "बेरीनाग",
                "देवलथल",
                "धारचूला",
                "डीडीहाट",
                "गनाई",
                "गंगोलीहाट",
                "कनालीछीना",
                "मुनस्यारी",
                "पिथौरागढ़",
                "तेजम",
                "थल"
            )

            "Udham Singh Nagar" -> listOf(
                "बाजपुर",
                "गदरपुर",
                "जसपुर",
                "काशीपुर",
                "खटीमा",
                "किच्छा",
                "नानकमत्ता",
                "रुद्रपुर",
                "सितारगंज"
            )

            else -> emptyList()
        }
    }


}